package level10FinalAssignment.ten3;
/*
погодный Telegram-бот

Напишите бота для Telegram, который будет:

Сообщать текущую погоду и прогноз на сутки в ответ на присланное местоположение.
Присылать прогноз погоды на сутки каждый день, если пользователь подписался на ежедневную рассылку.
Подписка должна происходить с помощью команды /subscribe.
Также должна быть предусмотрена возможность отписки (/unsubscribe).

Для получения прогноза можно использовать https://openweathermap.org/api.

Эта задача скорее на умение и способность разобраться в новой технологии (bot-api) и разных библиотеках. А еще настроить VPN надо! И код написать придётся, само собой.

Кстати, интересный факт — большинство студентов игнорируют словосочетание «присланное местоположение» и наличие возможности его отправки.
Они пишут бота, который ожидает название города. Я не знаю почему.
Это часто работает плохо, код становится немного сложнее, но они продолжают это делать.
 */
public class Main {
}
