package level3Recursion.threeTwo;
/*
3.2. Бинарное дерево поиска

Реализация бинарного дерева поиска — отличная задача. Я обычно даю её, когда заходит разговор про рекурсию.
https://ru.wikipedia.org/wiki/%D0%94%D0%B2%D0%BE%D0%B8%D1%87%D0%BD%D0%BE%D0%B5_%D0%B4%D0%B5%D1%80%D0%B5%D0%B2%D0%BE_%D0%BF%D0%BE%D0%B8%D1%81%D0%BA%D0%B0
Об этом я тоже много писать не буду, есть много статей/реализаций самого разного вида:
Структуры данных: бинарные деревья. https://habr.com/ru/post/65617/
Бинарное дерево, быстрая реализация https://habr.com/ru/post/343118/
Реализация на Java хешированного бинарного дерева https://habr.com/ru/post/324988/
 */
public class Main {
}
