package level4Inheritance.fourThree;
/*
4.3. Реализовать иерархию классов, описывающую трёхмерные фигуры — 4

Задача:

Добавьте в иерархию классов фигуру вращения для произвольной функции.
Вычислять объём можно приближенное с помощью определённого интеграла.
Так как объём фигуры вращения вокруг оси x это
Vx = (пи) интеграл от а до b. f^2(x)dx
А интеграл это
(пи) интеграл от а до b. f^2(x)dx = lim... блять я это не опишу
image


То можно написать реализацию метода прямоугольников:
https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D1%82%D0%BE%D0%B4_%D0%BF%D1%80%D1%8F%D0%BC%D0%BE%D1%83%D0%B3%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2

 */
public class Main {
}
